root-2.3.0/run/MicroChannelFOAM/TurbulenceMicroChannel/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.5 0 0);

boundaryField
{
    AirInlet
    {
        type            fixedValue;
        value           uniform (0.1 0 0);
    }
    WaterInlet
    {
        type            fixedValue;
        value           uniform (0.5 0 0);
    }
    ChannelWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    Outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    FrontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
