root-2.3.0/run/MicroChannelFOAM/TurbulenceMicroChannel/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    AirInlet
    {
        type            fixedValue;
        value           $internalField;
    }
    WaterInlet
    {
        type            fixedValue;
        value           $internalField;
    }
    ChannelWall
    {
        type            fixedValue;
        value           $internalField;
    }
    Outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.1;
        value           uniform 0.1;
    }
    FrontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
