root-2.3.0/run/MicroChannelFOAM/TurbulenceMicroChannel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    AirInlet
    {
        type            patch;
        nFaces          1;
        startFace       1024;
    }
    WaterInlet
    {
        type            patch;
        nFaces          10;
        startFace       1025;
    }
    ChannelWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          110;
        startFace       1035;
    }
    Outlet
    {
        type            patch;
        nFaces          11;
        startFace       1145;
    }
    FrontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1090;
        startFace       1156;
    }
)

// ************************************************************************* //
